blog-posts/2004-04-13-thoughts-on-progress-reports.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Thoughts on progress reports</title>
<!-- 2015-10-19 Mon 14:04 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Thoughts on progress reports</h1>
<p>
April 13th, 2004 -
<a href="http://sachachua.com/blog/p/1960"><a href="http://sachachua.com/blog/p/1960">http://sachachua.com/blog/p/1960</a></a>
</p>

<p>
<a href="http://3w-agility.blogspot.com">Dean Michael Berris</a> blogged:
</p>

<blockquote>
<p>
I personally despise the need to write progress reports in human
 terms &#x2014; mainly I want to show that progress is being made in terms
 of code and functionality. I don't want to put down into writing
 things that I feel about my groupmates, but rather I would like to
 commend them just for their accomplishments. I've just submitted
 one progress report, and I never really liked it. My grade may be
 in jeopardy because of that, but anyway that's how I personally
 feel.
</p>
</blockquote>

<p>
I find I \<sub>like\</sub>_ making progress reports, if only in terms of e-mail to
 the emacs-wiki-discuss mailing list or entries in blog. I like
 summarizing my changes in a changelog and telling people about my
 future plans. Not everyone can glance at code and understand it. Even
 I'd get lost if I had to stare at my diffs to find out what I changed
 when. I think progress reports are a Good Thing.
</p>

<p>
In fact, I think they're such a good thing that I want my students to
 do them, even the first year students. I want them to get into the
 habit of reflecting on what they've done, what they've learned, and
 what they still need to learn. I want them to get into the habit of
 mapping out what they want to do and marking out what they've
 accomplished. I want them to explore not only their accomplishments in
 terms of code but their growth in so many other areas, like working
 with groupmates. I want to hear about problems not just at the end but
 throughout the duration of the project.
</p>

<p>
<a href="http://sachachua.com/notebook/wiki/PersonalityQuizzes">PersonalityQuizzes</a>
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
